### Project : Analysing Music Records Sales using SQL
Chinook is a fictional music record store based out of the USA. The store offers a wide range of music genres, from classic rock and jazz to modern indie and hip-hop. With a passion for music and a commitment to providing exceptional customer
experiences, Chinook aims to be the go-to destination for music lovers.

### To achieve so, they have the following business objectives:
1. Establish Chinook as the premier destination for music records.
2. Provide a diverse selection of music genres to cater to a wide range of customer preferences.
3. Deliver excellent customer service to enhance the shopping experience.
4. Build a loyal customer base and foster long-term relationships through engagement and promotional events.

In [1]:
import numpy as np
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')
database = 'chinook.db'

In [2]:
 conn = sqlite3.connect(database)
tables = pd.read_sql("""SELECT *
 FROM sqlite_master
 WHERE type='table';
 """, conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,album,album,2,CREATE TABLE [album]\n(\n [album_id] INTEGE...
1,table,artist,artist,3,CREATE TABLE [artist]\n(\n [artist_id] INTE...
2,table,customer,customer,4,CREATE TABLE [customer]\n(\n [customer_id] ...
3,table,employee,employee,5,CREATE TABLE [employee]\n(\n [employee_id] ...
4,table,genre,genre,6,CREATE TABLE [genre]\n(\n [genre_id] INTEGE...
5,table,invoice,invoice,7,CREATE TABLE [invoice]\n(\n [invoice_id] IN...
6,table,invoice_line,invoice_line,8,CREATE TABLE [invoice_line]\n(\n [invoice_l...
7,table,media_type,media_type,9,CREATE TABLE [media_type]\n(\n [media_type_...
8,table,playlist,playlist,10,CREATE TABLE [playlist]\n(\n [playlist_id] ...
9,table,playlist_track,playlist_track,11,CREATE TABLE [playlist_track]\n(\n [playlis...
10,table,track,track,13,CREATE TABLE [track]\n(\n [track_id] INTEGE...

### Segment 1: Database - Tables, Columns, Relationships
Identify the tables in the database and their respective columns.
Determine the number of records in each table within the schema.
Identify and handle any missing or inconsistent values in the dataset.
Analyse the data types of the columns in each table to ensure they are appropriate for the stor

In [3]:
query1 = pd.read_sql("""
pragma table_info('customer');
""", conn)
query1

    cid            name          type  notnull dflt_value  pk
0     0     customer_id       INTEGER        1       None   1
1     1      first_name  NVARCHAR(40)        1       None   0
2     2       last_name  NVARCHAR(20)        1       None   0
3     3         company  NVARCHAR(80)        0       None   0
4     4         address  NVARCHAR(70)        0       None   0
5     5            city  NVARCHAR(40)        0       None   0
6     6           state  NVARCHAR(40)        0       None   0
7     7         country  NVARCHAR(40)        0       None   0
8     8     postal_code  NVARCHAR(10)        0       None   0
9     9           phone  NVARCHAR(24)        0       None   0
10   10             fax  NVARCHAR(24)        0       None   0
11   11           email  NVARCHAR(60)        1       None   0
12   12  support_rep_id       INTEGER        0       None   0

### Segment 2: Track/Album Analysis
How many tracks does Chinook store have in total

In [9]:
query2 = pd.read_sql("""
SELECT count(Distinct Name) as Total_No_Of_Track_Is
FROM Track;
""", conn)
query2

   Total_No_Of_Track_Is
0                  3257

### Which tracks are the most popular among customers?

In [11]:

query3 = pd.read_sql("""
Select t.track_Id, t.Name, count(il.Track_Id) as No_of_sales
from Track t
inner join Invoice_Line il
on t.Track_Id = il.Track_Id
group by 1 , 2
order by 3 desc
limit 10
""", conn)
query3

   track_id                      name  No_of_sales
0      3336                  War Pigs           31
1      1489      Are You Experienced?           14
2      1495             Highway Chile           14
3         6     Put The Finger On You           13
4      1487  Third Stone From The Sun           13
5      1490                   Hey Joe           13
6      1483         Love Or Confusion           12
7      2558               Radio/Video           12
8      1129           Dead And Broken           11
9      1479                 Foxy Lady           11

### What are the top-selling albums in the Chinook store?

In [14]:

query4 = pd.read_sql("""
SELECT
 a.Album_Id,
 a.Title AS AlbumTitle,
 COUNT(il.Invoice_Line_Id) AS NumTracksSold
FROM
 Album a
JOIN
 Track t ON a.Album_Id = t.Album_Id
JOIN
 Invoice_Line il ON t.Track_Id = il.Track_Id
GROUP BY
 a.Album_Id, a.Title
ORDER BY
 NumTracksSold DESC
LIMIT 10;
""",conn)
query4

   album_id                                  AlbumTitle  NumTracksSold
0       120                        Are You Experienced?            187
1        88                                    Faceless             96
2       207                                   Mezmerize             93
3       119                                    Get Born             90
4       214                                   The Doors             83
5         5                                    Big Ones             80
6       185                             Greatest Hits I             80
7       215                    The Police Greatest Hits             80
8       163  From The Muddy Banks Of The Wishkah [live]             78
9       221    My Generation - The Very Best Of The Who             76

### Which artist or album has the highest number of tracks in the store

In [18]:
query5 = pd.read_sql("""
SELECT
 a.Artist_Id,
 a.Name AS ArtistName,
 al.Album_Id,
 al.Title AS AlbumTitle,
 COUNT(t.Track_Id) AS NumTracks
FROM
 Artist a
LEFT JOIN
 Album al ON a.Artist_Id = al.Artist_Id
LEFT JOIN
 Track t ON al.Album_Id = t.Album_Id
GROUP BY
 a.Artist_Id, a.Name, al.Album_Id, al.Title
ORDER BY
 NumTracks DESC
LIMIT 1;
""", conn)
query5

   artist_id     ArtistName  album_id     AlbumTitle  NumTracks
0        100  Lenny Kravitz       141  Greatest Hits         57

### Determine the number of tracks for each album and calculate the total duration of each album. Identify the albums that have the highest average track duration.

In [23]:

query6 = pd.read_sql("""
select 
a.album_id, a.title as Album_Title,count(t.track_id),
sum(t.Milliseconds)/60000 as DurationOfAlbum,
round(AVG(t.Milliseconds),2)/60000 AS AverageTrackDurationMilliseconds
from album a 
left join track t
on a.album_id = t.album_id
group by 1,2
order by 5 desc
""",conn)
query6

,album_id,Album_Title,count(t.track_id),DurationOfAlbum,AverageTrackDurationMilliseconds
0,253,"Battlestar Galactica (Classic), Season 1",24,1170,48.759572
1,227,"Battlestar Galactica, Season 3",19,879,46.304422
2,229,"Lost, Season 3",26,1177,45.298450
3,231,"Lost, Season 2",24,1054,43.951133
4,226,Battlestar Galactica: The Story So Far,1,43,43.704167
...,...,...,...,...,...
342,328,"Charpentier: Divertissements, Airs & Concerts",1,1,1.837767
343,314,English Renaissance,2,3,1.691350
344,318,SCRIABIN: Vers la flamme,1,1,1.688217
345,345,Monteverdi: L'Orfeo,1,1,1.110650
346,340,Liszt - 12 Études D'Execution Transcendante,1,0,0.863000

### How does the genre distribution vary among albums?

In [29]:
query7 = pd.read_sql("""
SELECT
 a.Album_Id,
 a.Title AS AlbumTitle,
 COUNT(DISTINCT t.Genre_Id) AS NumberOfGenres,
 GROUP_CONCAT(DISTINCT g.Name) AS GenresList
FROM
 Album a
LEFT JOIN
 Track t ON a.Album_Id = t.Album_Id
LEFT JOIN
 Genre g ON t.Genre_Id = g.Genre_Id
GROUP BY
 a.Album_Id, a.Title
ORDER BY
 NumberOfGenres DESC;
""",conn)
query7

,album_id,AlbumTitle,NumberOfGenres,GenresList
0,141,Greatest Hits,3,"Rock,Reggae,Metal"
1,227,"Battlestar Galactica, Season 3",3,"TV Shows,Science Fiction,Sci Fi & Fantasy"
2,73,Unplugged,2,"Blues,Latin"
3,102,Live After Death,2,"Heavy Metal,Metal"
4,109,Rock In Rio [cd2],2,"Rock,Metal"
...,...,...,...,...
342,343,Respighi:Pines of Rome,1,Classical
343,344,Schubert: The Late String Quartets & String Qu...,1,Classical
344,345,Monteverdi: L'Orfeo,1,Classical
345,346,Mozart: Chamber Music,1,Classical
346,347,Koyaanisqatsi (Soundtrack from the Motion Pict...,1,Soundtrack

In [31]:

query8 = pd.read_sql("""
select g.name,count(a.album_id) as NoofAlbum
from genre g
join track t
on t.genre_id = g.genre_id
join album a
on t.album_id = a.album_id
group by 1
order by 2 desc
""", conn)
query8

                  name  NoofAlbum
0                 Rock       1297
1                Latin        579
2                Metal        374
3   Alternative & Punk        332
4                 Jazz        130
5             TV Shows         93
6                Blues         81
7            Classical         74
8                Drama         64
9             R&B/Soul         61
10              Reggae         58
11                 Pop         48
12          Soundtrack         43
13         Alternative         40
14         Hip Hop/Rap         35
15   Electronica/Dance         30
16               World         28
17         Heavy Metal         28
18    Sci Fi & Fantasy         26
19      Easy Listening         24
20              Comedy         17
21          Bossa Nova         15
22     Science Fiction         13
23       Rock And Roll         12
24               Opera          1

### Segment 3: Customer Analysis
Analyse customer demographics, purchase history, and preferences.

In [32]:
query9 = pd.read_sql("""
select *
from customer
""", conn)
query9

,customer_id,first_name,last_name,company,address,city,state,country,postal_code,phone,fax,email,support_rep_id
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4
5,6,Helena,Holý,None,Rilská 3174/6,Prague,None,Czech Republic,14300,+420 2 4177 0449,None,hholy@gmail.com,5
6,7,Astrid,Gruber,None,"Rotenturmstraße 4, 1010 Innere Stadt",Vienne,None,Austria,1010,+43 01 5134505,None,astrid.gruber@apple.at,5
7,8,Daan,Peeters,None,Grétrystraat 63,Brussels,None,Belgium,1000,+32 02 219 03 03,None,daan_peeters@apple.be,4
8,9,Kara,Nielsen,None,Sønder Boulevard 51,Copenhagen,None,Denmark,1720,+453 3331 9991,None,kara.nielsen@jubii.dk,4
9,10,Eduardo,Martins,Woodstock Discos,"Rua Dr. Falcão Filho, 155",São Paulo,SP,Brazil,01007-010,+55 (11) 3033-5446,+55 (11) 3033-4564,eduardo@woodstock.com.br,4
10,11,Alexandre,Rocha,Banco do Brasil S.A.,"Av. Paulista, 2022",São Paulo,SP,Brazil,01310-200,+55 (11) 3055-3278,+55 (11) 3055-8131,alero@uol.com.br,5
11,12,Roberto,Almeida,Riotur,"Praça Pio X, 119",Rio de Janeiro,RJ,Brazil,20040-020,+55 (21) 2271-7000,+55 (21) 2271-7070,roberto.almeida@riotur.gov.br,3
12,13,Fernanda,Ramos,None,Qe 7 Bloco G,Brasília,DF,Brazil,71020-677,+55 (61) 3363-5547,+55 (61) 3363-7855,fernadaramos4@uol.com.br,4
13,14,Mark,Philips,Telus,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,+1 (780) 434-4554,+1 (780) 434-5565,mphilips12@shaw.ca,5
14,15,Jennifer,Peterson,Rogers Canada,700 W Pender Street,Vancouver,BC,Canada,V6C 1G8,+1 (604) 688-2255,+1 (604) 688-8756,jenniferp@rogers.ca,3
15,16,Frank,Harris,Google Inc.,1600 Amphitheatre Parkway,Mountain View,CA,USA,94043-1351,+1 (650) 253-0000,+1 (650) 253-0000,fharris@google.com,4
16,17,Jack,Smith,Microsoft Corporation,1 Microsoft Way,Redmond,WA,USA,98052-8300,+1 (425) 882-8080,+1 (425) 882-8081,jacksmith@microsoft.com,5
17,18,Michelle,Brooks,None,627 Broadway,New York,NY,USA,10012-2612,+1 (212) 221-3546,+1 (212) 221-4679,michelleb@aol.com,3
18,19,Tim,Goyer,Apple Inc.,1 Infinite Loop,Cupertino,CA,USA,95014,+1 (408) 996-1010,+1 (408) 996-1011,tgoyer@apple.com,3
19,20,Dan,Miller,None,541 Del Medio Avenue,Mountain View,CA,USA,94040-111,+1 (650) 644-3358,None,dmiller@comcast.com,4
20,21,Kathy,Chase,None,801 W 4th Street,Reno,NV,USA,89503,+1 (775) 223-7665,None,kachase@hotmail.com,5
21,22,Heather,Leacock,None,120 S Orange Ave,Orlando,FL,USA,32801,+1 (407) 999-7788,None,hleacock@gmail.com,4
22,23,John,Gordon,None,69 Salem Street,Boston,MA,USA,2113,+1 (617) 522-1333,None,johngordon22@yahoo.com,4
23,24,Frank,Ralston,None,162 E Superior Street,Chicago,IL,USA,60611,+1 (312) 332-3232,None,fralston@gmail.com,3
24,25,Victor,Stevens,None,319 N. Frances Street,Madison,WI,USA,53703,+1 (608) 257-0597,None,vstevens@yahoo.com,5
25,26,Richard,Cunningham,None,2211 W Berry Street,Fort Worth,TX,USA,76110,+1 (817) 924-7272,None,ricunningham@hotmail.com,4
26,27,Patrick,Gray,None,1033 N Park Ave,Tucson,AZ,USA,85719,+1 (520) 622-4200,None,patrick.gray@aol.com,4
27,28,Julia,Barnett,None,302 S 700 E,Salt Lake City,UT,USA,84102,+1 (801) 531-7272,None,jubarnett@gmail.com,5
28,29,Robert,Brown,None,796 Dundas Street West,Toronto,ON,Canada,M6J 1V1,+1 (416) 363-8888,None,robbrown@shaw.ca,3
29,30,Edward,Francis,None,230 Elgin Street,Ottawa,ON,Canada,K2P 1L7,+1 (613) 234-3322,None,edfrancis@yachoo.ca,3
30,31,Martha,Silk,None,194A Chain Lake Drive,Halifax,NS,Canada,B3S 1C5,+1 (902) 450-0450,None,marthasilk@gmail.com,5
31,32,Aaron,Mitchell,None,696 Osborne Street,Winnipeg,MB,Canada,R3L 2B9,+1 (204) 452-6452,None,aaronmitchell@yahoo.ca,4
32,33,Ellie,Sullivan,None,5112 48 Street,Yellowknife,NT,Canada,X1A 1N6,+1 (867) 920-2233,None,ellie.sullivan@shaw.ca,3
33,34,João,Fernandes,None,Rua da Assunção 53,Lisbon,None,Portugal,None,+351 (213) 466-111,None,jfernandes@yahoo.pt,4
34,35,Madalena,Sampaio,None,"Rua dos Campeões Europeus de Viena, 4350",Porto,None,Portugal,None,+351 (225) 022-448,None,masampaio@sapo.pt,4
35,36,Hannah,Schneider,None,Tauentzienstraße 8,Berlin,None,Germany,10789,+49 030 26550280,None,hannah.schneider@yahoo.de,5
36,37,Fynn,Zimmermann,None,Berger Straße 10,Frankfurt,None,Germany,60316,+49 069 40598889,None,fzimmermann@yahoo.de,3
37,38,Niklas,Schröder,None,Barbarossastraße 19,Berlin,None,Germany,10779,+49 030 2141444,None,nschroder@surfeu.de,3
38,39,Camille,Bernard,None,"4, Rue Milton",Paris,None,France,75009,+33 01 49 70 65 65,None,camille.bernard@yahoo.fr,4
39,40,Dominique,Lefebvre,None,"8, Rue Hanovre",Paris,None,France,75002,+33 01 47 42 71 71,None,dominiquelefebvre@gmail.com,4
40,41,Marc,Dubois,None,"11, Place Bellecour",Lyon,None,France,69002,+33 04 78 30 30 30,None,marc.dubois@hotmail.com,5
41,42,Wyatt,Girard,None,"9, Place Louis Barthou",Bordeaux,None,France,33000,+33 05 56 96 96 96,None,wyatt.girard@yahoo.fr,3
42,43,Isabelle,Mercier,None,"68, Rue Jouvence",Dijon,None,France,21000,+33 03 80 73 66 99,None,isabelle_mercier@apple.fr,3
43,44,Terhi,Hämäläinen,None,Porthaninkatu 9,Helsinki,None,Finland,00530,+358 09 870 2000,None,terhi.hamalainen@apple.fi,3
44,45,Ladislav,Kovács,None,Erzsébet krt. 58.,Budapest,None,Hungary,H-1073,None,None,ladislav_kovacs@apple.hu,3
45,46,Hugh,O'Reilly,None,3 Chatham Street,Dublin,Dublin,Ireland,None,+353 01 6792424,None,hughoreilly@apple.ie,3
46,47,Lucas,Mancini,None,"Via Degli Scipioni, 43",Rome,RM,Italy,00192,+39 06 39733434,None,lucas.mancini@yahoo.it,5
47,48,Johannes,Van der Berg,None,Lijnbaansgracht 120bg,Amsterdam,VV,Netherlands,1016,+31 020 6223130,None,johavanderberg@yahoo.nl,5
48,49,Stanisław,Wójcik,None,Ordynacka 10,Warsaw,None,Poland,00-358,+48 22 828 37 39,None,stanisław.wójcik@wp.pl,4
49,50,Enrique,Muñoz,None,C/ San Bernardo 85,Madrid,None,Spain,28015,+34 914 454 454,None,enrique_munoz@yahoo.es,5
50,51,Joakim,Johansson,None,Celsiusg. 9,Stockholm,None,Sweden,11230,+46 08-651 52 52,None,joakim.johansson@yahoo.se,5
51,52,Emma,Jones,None,202 Hoxton Street,London,None,United Kingdom,N1 5LH,+44 020 7707 0707,None,emma_jones@hotmail.com,3
52,53,Phil,Hughes,None,113 Lupus St,London,None,United Kingdom,SW1V 3EN,+44 020 7976 5722,None,phil.hughes@gmail.com,3
53,54,Steve,Murray,None,110 Raeburn Pl,Edinburgh,None,United Kingdom,EH4 1HH,+44 0131 315 3300,None,steve.murray@yahoo.uk,5
54,55,Mark,Taylor,None,421 Bourke Street,Sidney,NSW,Australia,2010,+61 (02) 9332 3633,None,mark.taylor@yahoo.au,4
55,56,Diego,Gutiérrez,None,307 Macacha Güemes,Buenos Aires,None,Argentina,1106,+54 (0)11 4311 4333,None,diego.gutierrez@yahoo.ar,4
56,57,Luis,Rojas,None,"Calle Lira, 198",Santiago,None,Chile,None,+56 (0)2 635 4444,None,luisrojas@yahoo.cl,5
57,58,Manoj,Pareek,None,"12,Community Centre",Delhi,None,India,110017,+91 0124 39883988,None,manoj.pareek@rediff.com,3
58,59,Puja,Srivastava,None,"3,Raj Bhavan Road",Bangalore,None,India,560001,+91 080 22289999,None,puja_srivastava@yahoo.in,3

### How many unique customers are there in the Chinook store?

In [34]:

quer10 = pd.read_sql("""
SELECT COUNT(DISTINCT Customer_Id) AS UniqueCustomersCount
 FROM Customer;
""",conn)
quer10

   UniqueCustomersCount
0                    59

#### Identify the average number of tracks purchased per customer for each genre

In [36]:

query11 = pd.read_sql("""
SELECT g.Name AS GenreName,
 COUNT(il.Track_Id) / COUNT(DISTINCT c.Customer_Id) AS AvgTracksPurchasedPerCustomer
FROM Genre g
JOIN Track t ON g.Genre_Id = t.Genre_Id
JOIN Invoice_Line il ON t.Track_Id = il.Track_Id
JOIN Invoice i ON il.Invoice_Id = i.Invoice_Id
JOIN Customer c ON i.Customer_Id = c.Customer_Id
GROUP BY g.Name
order by 2 desc
limit 10;
""",conn)
query11

            GenreName  AvgTracksPurchasedPerCustomer
0                Rock                             44
1               Metal                             10
2  Alternative & Punk                              8
3            R&B/Soul                              3
4               Latin                              3
5               Blues                              3
6                Jazz                              2
7         Hip Hop/Rap                              2
8   Electronica/Dance                              2
9      Easy Listening                              2

### What is the average purchase value per customer?

In [39]:

query12 = pd.read_sql("""
SELECT round(AVG(total_purchase),2) AS AveragePurchaseValuePerCustomer
FROM (
 SELECT c.Customer_Id, SUM(il.Unit_Price) AS total_purchase
 FROM Customer c
 JOIN Invoice i ON c.Customer_Id = i.Customer_Id
 JOIN Invoice_Line il ON i.Invoice_Id = il.Invoice_Id
 GROUP BY c.Customer_Id
) AS customer_purchases;
""",conn)
query12

   AveragePurchaseValuePerCustomer
0                            79.82

### Which customers have made the highest number of purchases?

In [45]:
query13 = pd.read_sql("""
SELECT c.Customer_Id, c.First_Name, c.Last_Name, COUNT(i.Invoice_Id) AS PurchaseCount
FROM Customer c
JOIN Invoice i ON c.Customer_Id = i.Customer_Id
GROUP BY c.Customer_Id, c.First_Name, c.Last_Name
ORDER BY PurchaseCount DESC;
""",conn)
query13

    customer_id first_name     last_name  PurchaseCount
0             5  František   Wichterlová             18
1            35   Madalena       Sampaio             16
2            13   Fernanda         Ramos             15
3             1       Luís     Gonçalves             13
4            30     Edward       Francis             13
5            34       João     Fernandes             13
6            46       Hugh      O'Reilly             13
7            57       Luis         Rojas             13
8            58      Manoj        Pareek             13
9             6     Helena          Holý             12
10           10    Eduardo       Martins             12
11           17       Jack         Smith             12
12           20        Dan        Miller             12
13           22    Heather       Leacock             12
14           26    Richard    Cunningham             12
15           33      Ellie      Sullivan             12
16           43   Isabelle       Mercier             12
17            2     Leonie        Köhler             11
18           12    Roberto       Almeida             11
19           21      Kathy         Chase             11
20           31     Martha          Silk             11
21           36     Hannah     Schneider             11
22           42      Wyatt        Girard             11
23           44      Terhi    Hämäläinen             11
24           50    Enrique         Muñoz             11
25           53       Phil        Hughes             11
26            9       Kara       Nielsen             10
27           11  Alexandre         Rocha             10
28           14       Mark       Philips             10
29           23       John        Gordon             10
30           25     Victor       Stevens             10
31           28      Julia       Barnett             10
32           37       Fynn    Zimmermann             10
33           45   Ladislav        Kovács             10
34           48   Johannes  Van der Berg             10
35           49  Stanisław        Wójcik             10
36           51     Joakim     Johansson             10
37           55       Mark        Taylor             10
38            3   François      Tremblay              9
39            4      Bjørn        Hansen              9
40            7     Astrid        Gruber              9
41           15   Jennifer      Peterson              9
42           19        Tim         Goyer              9
43           27    Patrick          Gray              9
44           38     Niklas      Schröder              9
45           39    Camille       Bernard              9
46           40  Dominique      Lefebvre              9
47           41       Marc        Dubois              9
48           47      Lucas       Mancini              9
49           54      Steve        Murray              9
50           16      Frank        Harris              8
51           18   Michelle        Brooks              8
52           24      Frank       Ralston              8
53           32      Aaron      Mitchell              8
54           52       Emma         Jones              8
55           59       Puja    Srivastava              8
56            8       Daan       Peeters              7
57           56      Diego     Gutiérrez              5
58           29     Robert         Brown              4

### Segment 4: Support analysis
What is the total sales revenue generated by each sales support agent?

In [54]:

query14 = pd.read_sql("""
SELECT e.Employee_Id, e.first_name||" "||e.last_name as FullName, SUM(il.Unit_Price) AS TotalSalesRevenue
FROM Employee e
JOIN Customer c ON e.Employee_Id = c.Support_Rep_Id
JOIN Invoice i ON c.Customer_Id = i.Customer_Id
JOIN Invoice_Line il ON i.Invoice_Id = il.Invoice_Id
GROUP BY e.Employee_Id, e.First_Name, e.Last_Name;
""",conn)
query14

   employee_id       FullName  TotalSalesRevenue
0            3   Jane Peacock            1731.51
1            4  Margaret Park            1584.00
2            5  Steve Johnson            1393.92

### What is the average order value for each sales support agent?

In [60]:

query15 = pd.read_sql("""
SELECT e.Employee_Id, e.first_name||" "||e.last_name as FullName, 
 round(AVG(i.Total),2) AS AverageOrderValue
FROM Employee e
JOIN Customer c ON e.Employee_Id = c.Support_Rep_Id
JOIN Invoice i ON c.Customer_Id = i.Customer_Id
GROUP BY e.Employee_Id, e.First_Name, e.Last_Name;
""",conn)
query15

   employee_id       FullName  AverageOrderValue
0            3   Jane Peacock               8.17
1            4  Margaret Park               7.40
2            5  Steve Johnson               7.41

### Is there any significant difference in sales performance between agents reporting to different managers?

In [64]:
query16 = pd.read_sql("""
SELECT e2.Employee_Id AS Manager_Id, e2.First_Name||" "|| e2.last_name AS ManagerName,
 e1.Employee_Id AS Agent_Id, e1.First_Name||" "|| e1.last_name AS AgentName,
 AVG(i.Total) AS AverageOrderValue
FROM Employee e1
JOIN Employee e2 ON e1.Reports_To = e2.Employee_Id
JOIN Customer c ON e1.Employee_Id = c.Support_Rep_Id
JOIN Invoice i ON c.Customer_Id = i.Customer_Id
GROUP BY e2.Employee_Id, e2.First_Name, e2.Last_Name, e1.Employee_Id, e1.First_Name, e1.Last_Name;
""",conn)
query16

   Manager_Id    ManagerName  Agent_Id      AgentName  AverageOrderValue
0           2  Nancy Edwards         3   Jane Peacock           8.167500
1           2  Nancy Edwards         4  Margaret Park           7.401869
2           2  Nancy Edwards         5  Steve Johnson           7.414468

### How does the hiring date of sales support agents impact their sales performance?

In [68]:
query17 = pd.read_sql("""
SELECT e.Employee_Id,e.first_name ||" "||e.last_name as FullName, e.Hire_Date,
 AVG(i.Total) AS AverageOrderValue
FROM Employee e
JOIN Customer c ON e.Employee_Id = c.Support_Rep_Id
JOIN Invoice i ON c.Customer_Id = i.Customer_Id
GROUP BY e.Employee_Id, e.First_Name, e.Last_Name, e.Hire_Date;
""",conn)
query17

   employee_id       FullName            hire_date  AverageOrderValue
0            3   Jane Peacock  2017-04-01 00:00:00           8.167500
1            4  Margaret Park  2017-05-03 00:00:00           7.401869
2            5  Steve Johnson  2017-10-17 00:00:00           7.414468

### Segment 5: Sales Analysis
What is the total revenue generated by the Chinook store?

In [71]:
query18 = pd.read_sql("""
select sum(unit_price*quantity) as TotalRevenue
from invoice_line
""",conn)
query18

   TotalRevenue
0       4709.43

### How does the revenue vary across different countries?

In [78]:
query19 = pd.read_sql("""
select i.billing_country as Country,sum(il.unit_price*il.quantity) as Revenue
from invoice_line il
right join invoice i
on il.invoice_id = i.invoice_id
group by 1
""",conn)
query19

           Country  Revenue
0        Argentina    39.60
1        Australia    81.18
2          Austria    69.30
3          Belgium    60.39
4           Brazil   427.68
5           Canada   535.59
6            Chile    97.02
7   Czech Republic   273.24
8          Denmark    37.62
9          Finland    79.20
10          France   389.07
11         Germany   334.62
12         Hungary    78.21
13           India   183.15
14         Ireland   114.84
15           Italy    50.49
16     Netherlands    65.34
17          Norway    72.27
18          Poland    76.23
19        Portugal   185.13
20           Spain    98.01
21          Sweden    75.24
22             USA  1040.49
23  United Kingdom   245.52

### Calculate the percentage of total sales contributed by each genre in the USA and identify the best-selling genres and artists.

In [79]:
query20 = pd.read_sql("""
select g.name as Genre,
a.name as Artist,
SUM(il.Quantity * il.Unit_Price) AS TotalSales,
 ROUND(SUM(il.Quantity * il.Unit_Price) / (SELECT SUM(Quantity * Unit_Price) FROM Invoice_Line)* 100, 2) AS PercentageOfTotalSales
from genre g
inner join track t
on g.genre_id = t.genre_id
inner join invoice_line il
on t.track_id = il.track_id
inner join invoice i
on il.invoice_id = i.invoice_id
inner join album al
on al.album_id = t.album_id
inner join artist a
on a.artist_id = al.artist_id
where i.billing_country= 'USA'
group by 1,2
order by 3 desc
""",conn)
query20

,Genre,Artist,TotalSales,PercentageOfTotalSales
0,Rock,Van Halen,42.57,0.90
1,Rock,The Rolling Stones,36.63,0.78
2,Rock,Nirvana,34.65,0.74
3,Alternative & Punk,Green Day,31.68,0.67
4,Alternative & Punk,R.E.M.,31.68,0.67
...,...,...,...,...
111,Metal,Bruce Dickinson,0.99,0.02
112,Rock,Faith No More,0.99,0.02
113,Soundtrack,Gilberto Gil,0.99,0.02
114,Soundtrack,Passengers,0.99,0.02
115,TV Shows,Lost,0.99,0.02

### Evaluate sales performance over time to identify seasonal trends and peak periods.

In [83]:
query21 = pd.read_sql("""
select date(i.invoice_date) as Date, sum(il.quantity*il.unit_price) as TotalSales
from invoice i
inner join invoice_line il
on i.invoice_id = il.invoice_id
group by 1
""",conn)
query21

           Date  TotalSales
0    2017-01-03       25.74
1    2017-01-05        1.98
2    2017-01-06        7.92
3    2017-01-07       16.83
4    2017-01-10        1.98
..          ...         ...
498  2020-12-20        3.96
499  2020-12-21        6.93
500  2020-12-27       13.86
501  2020-12-29        8.91
502  2020-12-30       12.87

[503 rows x 2 columns]

### Determine the average transaction value and customer lifetime value to gauge business profitability.

In [86]:
query22 = pd.read_sql("""
select c.customer_id, avg(i.total) as AvgTransaction, sum(i.total) as LifetimeValue
from customer c
join invoice i
on c.customer_id = i.customer_id
group by 1;
""", conn)
query22

    customer_id  AvgTransaction  LifetimeValue
0             1        8.376923         108.90
1             2        7.470000          82.17
2             3       11.110000          99.99
3             4        8.030000          72.27
4             5        8.030000         144.54
5             6       10.725000         128.70
6             7        7.700000          69.30
7             8        8.627143          60.39
8             9        3.762000          37.62
9            10        5.032500          60.39
10           11        6.930000          69.30
11           12        7.470000          82.17
12           13        7.128000         106.92
13           14        2.970000          29.70
14           15        7.370000          66.33
15           16        9.281250          74.25
16           17        8.167500          98.01
17           18        9.900000          79.20
18           19        6.050000          54.45
19           20        7.920000          95.04
20           21        8.280000          91.08
21           22        7.672500          92.07
22           23        6.633000          66.33
23           24        8.910000          71.28
24           25        7.623000          76.23
25           26        7.177500          86.13
26           27        9.350000          84.15
27           28        7.227000          72.27
28           29       10.147500          40.59
29           30        7.006154          91.08
30           31        5.670000          62.37
31           32        8.786250          70.29
32           33        6.270000          75.24
33           34        7.920000         102.96
34           35        5.135625          82.17
35           36        7.740000          85.14
36           37        9.405000          94.05
37           38        8.140000          73.26
38           39        8.800000          79.20
39           40        8.030000          72.27
40           41        7.150000          64.35
41           42        9.090000          99.99
42           43        6.105000          73.26
43           44        7.200000          79.20
44           45        7.821000          78.21
45           46        8.833846         114.84
46           47        5.610000          50.49
47           48        6.534000          65.34
48           49        7.623000          76.23
49           50        8.910000          98.01
50           51        7.524000          75.24
51           52        8.538750          68.31
52           53        8.910000          98.01
53           54        8.800000          79.20
54           55        8.118000          81.18
55           56        7.920000          39.60
56           57        7.463077          97.02
57           58        8.605385         111.87
58           59        8.910000          71.28

### Segment 6: SQL Concepts
Use subqueries to find the top-selling tracks in the USA and identify their associated genres.

In [88]:
query23 = pd.read_sql("""
SELECT
 t.Name AS TrackName,
 g.Name AS GenreName,
 (SELECT COUNT(*) FROM Invoice_Line il
 JOIN Invoice i ON il.Invoice_Id = i.Invoice_Id
 JOIN Customer c ON i.Customer_Id = c.Customer_Id
 WHERE il.Track_Id = t.Track_Id AND c.Country = 'USA') AS TotalSales
FROM
 Track t
 JOIN Genre g ON t.Genre_Id = g.Genre_Id
 where totalsales != 0
ORDER BY
 TotalSales DESC
""", conn)
query23

                                         TrackName    GenreName  TotalSales
0                                         War Pigs  Alternative           6
1    You Know I'm No Good (feat. Ghostface Killah)     R&B/Soul           5
2                         Night Of The Long Knives         Rock           4
3                                       Evil Woman        Metal           4
4                                    Highway Chile         Rock           4
..                                             ...          ...         ...
785                                   October Song          Pop           1
786                           What Is It About Men          Pop           1
787                                  Help Yourself          Pop           1
788                            Amy Amy Amy (Outro)          Pop           1
789                                       Slowness  Alternative           1

[790 rows x 3 columns]

### Implement joins to retrieve customer information along with their preferred genres and country of origin.

In [90]:

query24 = pd.read_sql("""
SELECT c.Customer_Id, c.First_Name, c.Last_Name, c.Country, g.Name AS PreferredGenre
FROM
 Customer AS c
 LEFT JOIN Invoice AS i ON c.Customer_Id = i.Customer_Id
 LEFT JOIN Invoice_Line AS il ON i.Invoice_Id = il.Invoice_Id
 LEFT JOIN Track AS t ON il.Track_Id = t.Track_Id
 LEFT JOIN Genre AS g ON t.Genre_Id = g.Genre_Id
 
GROUP BY 1;
""", conn)
query24

    customer_id first_name     last_name         country      PreferredGenre
0             1       Luís     Gonçalves          Brazil                Rock
1             2     Leonie        Köhler         Germany                Rock
2             3   François      Tremblay          Canada                Rock
3             4      Bjørn        Hansen          Norway                Rock
4             5  František   Wichterlová  Czech Republic  Alternative & Punk
5             6     Helena          Holý  Czech Republic                Rock
6             7     Astrid        Gruber         Austria                Rock
7             8       Daan       Peeters         Belgium            R&B/Soul
8             9       Kara       Nielsen         Denmark   Electronica/Dance
9            10    Eduardo       Martins          Brazil  Alternative & Punk
10           11  Alexandre         Rocha          Brazil                Rock
11           12    Roberto       Almeida          Brazil                Rock
12           13   Fernanda         Ramos          Brazil                Rock
13           14       Mark       Philips          Canada                Rock
14           15   Jennifer      Peterson          Canada  Alternative & Punk
15           16      Frank        Harris             USA                Rock
16           17       Jack         Smith             USA                Rock
17           18   Michelle        Brooks             USA                Rock
18           19        Tim         Goyer             USA                Rock
19           20        Dan        Miller             USA                Rock
20           21      Kathy         Chase             USA                Rock
21           22    Heather       Leacock             USA               Blues
22           23       John        Gordon             USA               Metal
23           24      Frank       Ralston             USA                Rock
24           25     Victor       Stevens             USA  Alternative & Punk
25           26    Richard    Cunningham             USA            R&B/Soul
26           27    Patrick          Gray             USA                Rock
27           28      Julia       Barnett             USA                Rock
28           29     Robert         Brown          Canada                Rock
29           30     Edward       Francis          Canada                 Pop
30           31     Martha          Silk          Canada      Easy Listening
31           32      Aaron      Mitchell          Canada            R&B/Soul
32           33      Ellie      Sullivan          Canada                Jazz
33           34       João     Fernandes        Portugal                Rock
34           35   Madalena       Sampaio        Portugal                Rock
35           36     Hannah     Schneider         Germany               Metal
36           37       Fynn    Zimmermann         Germany                Rock
37           38     Niklas      Schröder         Germany  Alternative & Punk
38           39    Camille       Bernard          France                Rock
39           40  Dominique      Lefebvre          France                Rock
40           41       Marc        Dubois          France      Easy Listening
41           42      Wyatt        Girard          France   Electronica/Dance
42           43   Isabelle       Mercier          France               Blues
43           44      Terhi    Hämäläinen         Finland              Reggae
44           45   Ladislav        Kovács         Hungary                Rock
45           46       Hugh      O'Reilly         Ireland               Blues
46           47      Lucas       Mancini           Italy  Alternative & Punk
47           48   Johannes  Van der Berg     Netherlands            R&B/Soul
48           49  Stanisław        Wójcik          Poland                 Pop
49           50    Enrique         Muñoz           Spain               Metal
50           51     Joakim     Johansson          Sweden                Rock
51           52       Emma         Jones  United Kingdom                Rock
52           53       Phil        Hughes  United Kingdom                Rock
53           54      Steve        Murray  United Kingdom                Rock
54           55       Mark        Taylor       Australia                Rock
55           56      Diego     Gutiérrez       Argentina         Alternative
56           57       Luis         Rojas           Chile         Alternative
57           58      Manoj        Pareek           India         Hip Hop/Rap
58           59       Puja    Srivastava           India                Rock

### Apply window functions to rank genres based on their sales performance in the USA.

In [96]:

query25 = pd.read_sql("""
select rank() over(order by TotalQuantitySale desc) as Rank, *
from (select g.name as GenreName,count(il.quantity) as TotalQuantitySale
from invoice_line il
join track t on t.track_id = il.track_id
join genre g on g.genre_id = t.genre_id
join invoice i on i.invoice_id = il.invoice_id
where i.billing_country = 'USA'
group by g.name
);
""", conn)
query25

    Rank           GenreName  TotalQuantitySale
0      1                Rock                561
1      2  Alternative & Punk                130
2      3               Metal                124
3      4            R&B/Soul                 53
4      5               Blues                 36
5      6         Alternative                 35
6      7               Latin                 22
7      7                 Pop                 22
8      9         Hip Hop/Rap                 20
9     10                Jazz                 14
10    11      Easy Listening                 13
11    12              Reggae                  6
12    13   Electronica/Dance                  5
13    14           Classical                  4
14    15         Heavy Metal                  3
15    16          Soundtrack                  2
16    17            TV Shows                  1

### Create stored procedures to calculate the average revenue per sale for each genre in the USA.

In [100]:

query26 = pd.read_sql("""
select g.name as Genre, avg(il.quantity*il.unit_price) as AvgRevenue
from invoice_line il
join track t on t.track_id = il.track_id
join genre g on g.genre_id = t.genre_id
join invoice i on i.invoice_id = il.invoice_id
where i.billing_country = 'USA'
group by g.name
order by 2 desc;
""", conn)
query26

                 Genre  AvgRevenue
0                 Rock        0.99
1             R&B/Soul        0.99
2               Reggae        0.99
3                 Jazz        0.99
4       Easy Listening        0.99
5             TV Shows        0.99
6           Soundtrack        0.99
7    Electronica/Dance        0.99
8            Classical        0.99
9          Hip Hop/Rap        0.99
10         Heavy Metal        0.99
11                 Pop        0.99
12               Latin        0.99
13               Blues        0.99
14         Alternative        0.99
15               Metal        0.99
16  Alternative & Punk        0.99

### Segment 7: Market Expansion and Advertising Strategy
Recommend the three albums from the new record label that should be prioritised for advertising and promotion in the USA based on genre sales analysis.

In [105]:

query27 = pd.read_sql("""
SELECT
 a.Title AS AlbumTitle,
 g.Name AS GenreName,
 SUM(il.Quantity) AS TotalSales
FROM
 Album AS a
 JOIN Track AS t ON a.Album_Id = t.Album_Id
 JOIN Genre AS g ON t.Genre_Id = g.Genre_Id
 JOIN Invoice_Line AS il ON t.Track_Id = il.Track_Id
 JOIN Invoice AS i ON il.Invoice_Id = i.Invoice_Id
 JOIN Customer AS c ON i.Customer_Id = c.Customer_Id
WHERE
 c.Country = 'USA'
GROUP BY
 a.Album_Id
ORDER BY 3 desc;
""", conn)
query27

,AlbumTitle,GenreName,TotalSales
0,From The Muddy Banks Of The Wishkah [live],Rock,28
1,Are You Experienced?,Rock,28
2,The Doors,Rock,27
3,Seek And Shall Find: More Of The Best (1963-1981),R&B/Soul,26
4,"Hot Rocks, 1964-1971 (Disc 1)",Rock,25
...,...,...,...
167,Body Count,Alternative & Punk,1
168,Alcohol Fueled Brewtality Live! [Disc 1],Metal,1
169,Out Of Exile,Alternative & Punk,1
170,Restless and Wild,Rock,1
171,Balls to the Wall,Rock,1

### Identify high-value customers and develop personalised marketing strategies to nurture customer loyalty.

In [107]:

query28 = pd.read_sql("""
SELECT
 c.Customer_Id,
 c.First_Name ||" "||c.Last_Name as FullName,
 SUM(il.Unit_Price * il.Quantity) AS TotalRevenue,
 COUNT(DISTINCT i.Invoice_Id) AS TotalPurchases,
 AVG(il.Unit_price * il.Quantity) AS AverageOrderValue
FROM
 Customer AS c
 JOIN Invoice AS i ON c.Customer_Id = i.Customer_Id
 JOIN Invoice_Line AS il ON i.Invoice_Id = il.Invoice_Id
GROUP BY
 c.Customer_Id
HAVING
 TotalRevenue > 10
ORDER BY
 TotalRevenue DESC;
""", conn)
query28

,customer_id,FullName,TotalRevenue,TotalPurchases,AverageOrderValue
0,5,František Wichterlová,144.54,18,0.99
1,6,Helena Holý,128.70,12,0.99
2,46,Hugh O'Reilly,114.84,13,0.99
3,58,Manoj Pareek,111.87,13,0.99
4,1,Luís Gonçalves,108.90,13,0.99
5,13,Fernanda Ramos,106.92,15,0.99
6,34,João Fernandes,102.96,13,0.99
7,42,Wyatt Girard,99.99,11,0.99
8,3,François Tremblay,99.99,9,0.99
9,53,Phil Hughes,98.01,11,0.99
10,50,Enrique Muñoz,98.01,11,0.99
11,17,Jack Smith,98.01,12,0.99
12,57,Luis Rojas,97.02,13,0.99
13,20,Dan Miller,95.04,12,0.99
14,37,Fynn Zimmermann,94.05,10,0.99
15,22,Heather Leacock,92.07,12,0.99
16,30,Edward Francis,91.08,13,0.99
17,21,Kathy Chase,91.08,11,0.99
18,26,Richard Cunningham,86.13,12,0.99
19,36,Hannah Schneider,85.14,11,0.99
20,27,Patrick Gray,84.15,9,0.99
21,35,Madalena Sampaio,82.17,16,0.99
22,12,Roberto Almeida,82.17,11,0.99
23,2,Leonie Köhler,82.17,11,0.99
24,55,Mark Taylor,81.18,10,0.99
25,54,Steve Murray,79.20,9,0.99
26,44,Terhi Hämäläinen,79.20,11,0.99
27,39,Camille Bernard,79.20,9,0.99
28,18,Michelle Brooks,79.20,8,0.99
29,45,Ladislav Kovács,78.21,10,0.99
30,49,Stanisław Wójcik,76.23,10,0.99
31,25,Victor Stevens,76.23,10,0.99
32,51,Joakim Johansson,75.24,10,0.99
33,33,Ellie Sullivan,75.24,12,0.99
34,16,Frank Harris,74.25,8,0.99
35,43,Isabelle Mercier,73.26,12,0.99
36,38,Niklas Schröder,73.26,9,0.99
37,40,Dominique Lefebvre,72.27,9,0.99
38,28,Julia Barnett,72.27,10,0.99
39,4,Bjørn Hansen,72.27,9,0.99
40,59,Puja Srivastava,71.28,8,0.99
41,24,Frank Ralston,71.28,8,0.99
42,32,Aaron Mitchell,70.29,8,0.99
43,11,Alexandre Rocha,69.30,10,0.99
44,7,Astrid Gruber,69.30,9,0.99
45,52,Emma Jones,68.31,8,0.99
46,23,John Gordon,66.33,10,0.99
47,15,Jennifer Peterson,66.33,9,0.99
48,48,Johannes Van der Berg,65.34,10,0.99
49,41,Marc Dubois,64.35,9,0.99
50,31,Martha Silk,62.37,11,0.99
51,10,Eduardo Martins,60.39,12,0.99
52,8,Daan Peeters,60.39,7,0.99
53,19,Tim Goyer,54.45,9,0.99
54,47,Lucas Mancini,50.49,9,0.99
55,29,Robert Brown,40.59,4,0.99
56,56,Diego Gutiérrez,39.60,5,0.99
57,9,Kara Nielsen,37.62,10,0.99
58,14,Mark Philips,29.70,10,0.99

### Analyse the potential for expanding sales of different genres in other countries based on their sales performance in the USA.

In [109]:

query29 = pd.read_sql("""
SELECT
 g.Name AS GenreName,
 SUM(il.Quantity) AS TotalSales
FROM
 Genre AS g
 JOIN Track AS t ON g.Genre_Id = t.Genre_Id
 JOIN Invoice_Line AS il ON t.Track_Id = il.Track_Id
 JOIN Invoice AS i ON il.Invoice_Id = i.Invoice_Id
 JOIN Customer AS c ON i.Customer_Id = c.Customer_Id
WHERE
 c.Country = 'USA'
GROUP BY
 g.Genre_Id
""", conn)
query29

             GenreName  TotalSales
0                 Rock         561
1                 Jazz          14
2                Metal         124
3   Alternative & Punk         130
4                Blues          36
5                Latin          22
6               Reggae           6
7                  Pop          22
8           Soundtrack           2
9       Easy Listening          13
10         Heavy Metal           3
11            R&B/Soul          53
12   Electronica/Dance           5
13         Hip Hop/Rap          20
14            TV Shows           1
15         Alternative          35
16           Classical           4

### Determine the top-selling genres in countries other than the USA and identify any commonalities or differences.

In [110]:

query30 = pd.read_sql("""
SELECT
 c.Country,
 g.Name AS GenreName,
 SUM(il.Quantity) AS TotalSales
FROM
 Genre AS g
 JOIN Track AS t ON g.Genre_Id = t.Genre_Id
 JOIN Invoice_Line AS il ON t.Track_Id = il.Track_Id
 JOIN Invoice AS i ON il.Invoice_Id = i.Invoice_Id
 JOIN Customer AS c ON i.Customer_Id = c.Customer_Id
WHERE
 c.Country <> 'USA' -- Exclude the USA
GROUP BY
 c.Country,g.name
 order by 3 desc
""", conn)
query30

            country          GenreName  TotalSales
0            Canada               Rock         333
1            France               Rock         211
2            Brazil               Rock         205
3           Germany               Rock         194
4    United Kingdom               Rock         166
..              ...                ...         ...
252          Sweden             Reggae           1
253          Sweden         Soundtrack           1
254  United Kingdom  Electronica/Dance           1
255  United Kingdom        Heavy Metal           1
256  United Kingdom                Pop           1

[257 rows x 3 columns]